{
  "layers": [
    {
      "class_name": "InputLayer",
      "config": {
        "batch_input_shape": [null, 16],
        "dtype": "float32",
        "sparse": false,
        "ragged": false
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "trainable": true,
        "dtype": "float32",
        "units": 8,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {}
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    }
  ],
  "attribute": {
    "regularizer": [
      {
        "class_name": "L1",
        "config": {
          "l1": 0.009999999776482582
        }
      },
      {
        "class_name": "L2",
        "config": {
          "l2": 0.009999999776482582
        }
      },
      {
        "class_name": "L1L2",
        "config": {
          "l1": 0.009999999776482582,
          "l2": 0.009999999776482582
        }
      }
    ],
    "activation": [
      "elu",
      "exponential",
      "hard_sigmoid",
      "linear",
      "relu",
      "selu",
      "sigmoid",
      "softmax",
      "softplus",
      "softsign",
      "swish",
      "tanh"
    ],

    "initializer": [
      {
        "class_name": "Constant",
        "config": {
          "value": 0
        }
      },
      {
        "class_name": "GlorotNormal",
        "config": {
          "seed": null
        }
      },
      {
        "class_name": "GlorotUniform",
        "config": {
          "seed": null
        }
      },
      {
        "class_name": "HeNormal",
        "config": {
          "seed": null
        }
      },
      {
        "class_name": "HeUniform",
        "config": {
          "seed": null
        }
      },
      {
        "class_name": "Identity",
        "config": {
          "gain": 1
        }
      },
      {
        "class_name": "LecunNormal",
        "config": {
          "seed": null
        }
      },
      {
        "class_name": "LecunUniform",
        "config": {
          "seed": null
        }
      },
      {
        "class_name": "Ones",
        "config": {}
      },
      {
        "class_name": "Orthogonal",
        "config": {
          "gain": 1,
          "seed": null
        }
      },
      {
        "class_name": "RandomNormal",
        "config": {
          "mean": 0,
          "stddev": 0.05,
          "seed": null
        }
      },
      {
        "class_name": "RandomUniform",
        "config": {
          "minval": -0.05,
          "maxval": 0.05,
          "seed": null
        }
      },
      {
        "class_name": "TruncatedNormal",
        "config": {
          "mean": 0,
          "stddev": 0.05,
          "seed": null
        }
      },
      {
        "class_name": "VarianceScaling",
        "config": {
          "scale": 1,
          "mode": "fan_in",
          "distribution": "truncated_normal",
          "seed": null
        }
      },
      {
        "class_name": "Zeros",
        "config": {}
      }
    ],
    "constraint": [
      {
        "class_name": "MaxNorm",
        "config": {
          "max_value": 2,
          "axis": 0
        }
      },
      {
        "class_name": "MinMaxNorm",
        "config": {
          "min_value": 0,
          "max_value": 1,
          "rate": 1,
          "axis": 0
        }
      },
      {
        "class_name": "NonNeg",
        "config": {}
      },
      {
        "class_name": "RadialConstraint",
        "config": {}
      },
      {
        "class_name": "UnitNorm",
        "config": {
          "axis": 0
        }
      }
    ],
    "dtype": ["float16", "float32", "float64"]
  }
}
