{
  "layers": [
    {
      "layerValue": {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [16],
          "dtype": "float32",
          "sparse": false,
          "ragged": false
        }
      },
      "attribute": [
        {
          "batch_input_shape": "*"
        },
        {
          "dtype": ["float16", "float32", "float64"]
        },
        {
          "sparse": [true, false]
        },
        {
          "ragged": [true, false]
        }
      ]
    },
    {
      "layerValue": {
        "class_name": "Dense",
        "config": {
          "trainable": true,
          "dtype": "float32",
          "units": 8,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": "GlorotUniform",
          "bias_initializer": "Zeros",
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      "attribute": [
        {
          "trainable": [true, false]
        },
        {
          "dtype": ["float16", "float32", "float64"]
        },
        {
          "units": "1"
        },
        {
          "activation": [
            "elu",
            "exponential",
            "hard_sigmoid",
            "linear",
            "relu",
            "selu",
            "sigmoid",
            "softmax",
            "softplus",
            "softsign",
            "swish",
            "tanh"
          ]
        },
        {
          "use_bias": [true, false]
        },
        {
          "kernel_initializer": [
            "Constant",
            "GlorotNormal",
            "GlorotUniform",
            "HeNormal",
            "HeUniform",
            "Identity",
            "LecunNormal",
            "LecunUniform",
            "Ones",
            "Orthogonal",
            "RandomNormal",
            "RandomUniform",
            "TruncatedNormal",
            "VarianceScaling",
            "Zeros"
          ]
        },
        {
          "bias_initializer": [
            "Constant",
            "GlorotNormal",
            "GlorotUniform",
            "HeNormal",
            "HeUniform",
            "Identity",
            "LecunNormal",
            "LecunUniform",
            "Ones",
            "Orthogonal",
            "RandomNormal",
            "RandomUniform",
            "TruncatedNormal",
            "VarianceScaling",
            "Zeros"
          ]
        },
        {
          "kernel_regularizer": ["L1", "L2", "L1L2"]
        },
        {
          "bias_regularizer": ["L1", "L2", "L1L2"]
        },
        {
          "activity_regularizer": ["L1", "L2", "L1L2"]
        },
        {
          "kernel_constraint": ["MaxNorm", "MinMaxNorm", "NonNeg", "RadialConstraint", "UnitNorm"]
        },
        {
          "bias_constraint": ["MaxNorm", "MinMaxNorm", "NonNeg", "RadialConstraint", "UnitNorm"]
        }
      ]
    }
  ]
}
