{
  "layers": [
    {
      "class_name": "InputLayer",
      "config": {
        "batch_input_shape": [16],
        "dtype": "float32",
        "sparse": false,
        "ragged": false
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "trainable": true,
        "dtype": "float32",
        "units": 8,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": "GlorotUniform",
        "bias_initializer": "Zeros",
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    }
  ],
  "attributes": {
    "activation": [
      {
        "name": "elu",
        "value": "elu"
      },
      {
        "name": "exponential",
        "value": "exponential"
      },
      {
        "name": "hard_sigmoid",
        "value": "hard_sigmoid"
      },
      {
        "name": "linear",
        "value": "linear"
      },
      {
        "name": "relu",
        "value": "relu"
      },
      {
        "name": "selu",
        "value": "selu"
      },
      {
        "name": "sigmoid",
        "value": "sigmoid"
      },
      {
        "name": "softmax",
        "value": "softmax"
      },
      {
        "name": "softplus",
        "value": "softplus"
      },
      {
        "name": "softsign",
        "value": "softsign"
      },
      {
        "name": "swish",
        "value": "swish"
      },
      {
        "name": "tanh",
        "value": "tanh"
      }
    ],
    "regularizer": [
      {
        "name": "L1",
        "value": {
          "class_name": "L1",
          "config": {
            "l1": 0.009999999776482582
          }
        }
      },
      {
        "name": "L2",
        "value": {
          "class_name": "L2",
          "config": {
            "l2": 0.009999999776482582
          }
        }
      },
      {
        "name": "L1L2",
        "value": {
          "class_name": "L1L2",
          "config": {
            "l1": 0.009999999776482582,
            "l2": 0.009999999776482582
          }
        }
      }
    ],
    "initializer": [
      {
        "name": "Constant",
        "value": {
          "class_name": "Constant",
          "config": {
            "value": 0
          }
        }
      },
      {
        "name": "GlorotNormal",
        "value": {
          "class_name": "GlorotNormal",
          "config": {
            "seed": null
          }
        }
      },
      {
        "name": "GlorotUniform",
        "value": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        }
      },
      {
        "name": "HeNormal",
        "value": {
          "class_name": "HeNormal",
          "config": {
            "seed": null
          }
        }
      },
      {
        "name": "HeUniform",
        "value": {
          "class_name": "HeUniform",
          "config": {
            "seed": null
          }
        }
      },
      {
        "name": "Identity",
        "value": {
          "class_name": "Identity",
          "config": {
            "gain": 1
          }
        }
      },
      {
        "name": "LecunNormal",
        "value": {
          "class_name": "LecunNormal",
          "config": {
            "seed": null
          }
        }
      },
      {
        "name": "LecunUniform",
        "value": {
          "class_name": "LecunUniform",
          "config": {
            "seed": null
          }
        }
      },
      {
        "name": "Ones",
        "value": {
          "class_name": "Ones",
          "config": {}
        }
      },
      {
        "name": "Orthogonal",
        "value": {
          "class_name": "Orthogonal",
          "config": {
            "gain": 1,
            "seed": null
          }
        }
      },
      {
        "name": "RandomNormal",
        "value": {
          "class_name": "RandomNormal",
          "config": {
            "mean": 0,
            "stddev": 0.05,
            "seed": null
          }
        }
      },
      {
        "name": "RandomUniform",
        "value": {
          "class_name": "RandomUniform",
          "config": {
            "minval": -0.05,
            "maxval": 0.05,
            "seed": null
          }
        }
      },
      {
        "name": "TruncatedNormal",
        "value": {
          "class_name": "TruncatedNormal",
          "config": {
            "mean": 0,
            "stddev": 0.05,
            "seed": null
          }
        }
      },
      {
        "name": "VarianceScaling",
        "value": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_in",
            "distribution": "truncated_normal",
            "seed": null
          }
        }
      },
      {
        "name": "Zeros",
        "value": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    ],
    "constraint": [
      {
        "name": "MaxNorm",
        "value": {
          "class_name": "MaxNorm",
          "config": {
            "max_value": 2,
            "axis": 0
          }
        }
      },
      {
        "name": "MinMaxNorm",
        "value": {
          "class_name": "MinMaxNorm",
          "config": {
            "min_value": 0,
            "max_value": 1,
            "rate": 1,
            "axis": 0
          }
        }
      },
      {
        "name": "NonNeg",
        "value": {
          "class_name": "NonNeg",
          "config": {}
        }
      },
      {
        "name": "RadialConstraint",
        "value": {
          "class_name": "RadialConstraint",
          "config": {}
        }
      },
      {
        "name": "UnitNorm",
        "value": {
          "class_name": "UnitNorm",
          "config": {
            "axis": 0
          }
        }
      }
    ],
    "dtype": [
      {
        "name": "float16",
        "value": "float16"
      },
      {
        "name": "float32",
        "value": "float32"
      },
      {
        "name": "float64",
        "value": "float64"
      }
    ]
  }
}
