{
  "layers": [
    {
      "class_name": "InputLayer",
      "config": {
        "batch_input_shape": [null, 16],
        "dtype": "float32",
        "sparse": false,
        "ragged": false,
        "name": "input_1"
      },
      "inbound_nodes": []
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_1",
        "trainable": true,
        "dtype": "float32",
        "units": 8,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": "GlorotUniform",
        "bias_initializer": "Zeros",
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "inbound_nodes": ["input_1"]
    }
  ]
}
