{
  "layers": [
    {
      "class_name": "InputLayer",
      "config": {
        "batch_input_shape": [6],
        "dtype": "float32",
        "sparse": false,
        "ragged": false,
        "name": "deep_input"
      },
      "inbound_nodes": []
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense",
        "trainable": true,
        "dtype": "float32",
        "units": 30,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": "GlorotUniform",
        "bias_initializer": "Zeros",
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "dense",
      "inbound_nodes": ["deep_input"]
    },
    {
      "class_name": "InputLayer",
      "config": {
        "batch_input_shape": [5],
        "dtype": "float32",
        "sparse": false,
        "ragged": false,
        "name": "wide_input"
      },
      "inbound_nodes": []
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_1",
        "trainable": true,
        "dtype": "float32",
        "units": 30,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": "GlorotUniform",
        "bias_initializer": "Zeros",
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "inbound_nodes": ["dense"]
    },
    {
      "class_name": "Concatenate",
      "config": {
        "name": "concatenate",
        "trainable": true,
        "dtype": "float32",
        "axis": -1
      },
      "inbound_nodes": ["wide_input", "dense_1"]
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "output",
        "trainable": true,
        "dtype": "float32",
        "units": 1,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": "GlorotUniform",
        "bias_initializer": "Zeros",
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "inbound_nodes": ["concatenate"]
    }
  ]
}
