{
  "layers": [
    {
      "layerValue": {
        "class_name": "Input",
        "config": {
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "shape": [6]
        }
      },
      "attribute": {
        "dtype": ["float16", "float32", "float64"],
        "sparse": [true, false],
        "ragged": [true, false],
        "shape": "number_*"
      },
      "cnt_input": 0
    },
    {
      "layerValue": {
        "class_name": "Dense",
        "config": {
          "trainable": true,
          "dtype": "float32",
          "units": 30,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": "glorot_uniform",
          "bias_initializer": "zeros",
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      "attribute": {
        "trainable": [true, false],
        "dtype": ["float16", "float32", "float64"],
        "units": "number_1",
        "activation": [
          "elu",
          "exponential",
          "hard_sigmoid",
          "linear",
          "relu",
          "selu",
          "sigmoid",
          "softmax",
          "softplus",
          "softsign",
          "swish",
          "tanh"
        ],
        "use_bias": [true, false],
        "kernel_initializer": [
          "constant",
          "glorot_normal",
          "glorot_uniform",
          "he_normal",
          "he_uniform",
          "identity",
          "lecun_normal",
          "lecun_uniform",
          "ones",
          "orthogonal",
          "random_normal",
          "random_uniform",
          "truncated_normal",
          "variance_scaling",
          "zeros"
        ],
        "bias_initializer": [
          "constant",
          "glorot_normal",
          "glorot_uniform",
          "he_normal",
          "he_uniform",
          "identity",
          "lecun_normal",
          "lecun_uniform",
          "ones",
          "orthogonal",
          "random_normal",
          "random_uniform",
          "truncated_normal",
          "variance_scaling",
          "zeros"
        ],
        "kernel_regularizer": ["l1", "l2", "l1_l2", null],
        "bias_regularizer": ["l1", "l2", "l1_l2", null],
        "activity_regularizer": ["l1", "l2", "l1_l2", null],
        "kernel_constraint": [
          "max_norm",
          "min_max_norm",
          "non_neg",
          "radial_constraint",
          "unit_norm",
          null
        ],
        "bias_constraint": [
          "max_norm",
          "min_max_norm",
          "non_neg",
          "radial_constraint",
          "unit_norm",
          null
        ]
      },
      "cnt_input": 1
    },
    {
      "layerValue": {
        "class_name": "Concatenate",
        "config": {
          "trainable": true,
          "dtype": "float32",
          "axis": -1
        }
      },
      "attribute": {
        "trainable": [true, false],
        "dtype": ["float16", "float32", "float64"],
        "axis": "number_1"
      },
      "cnt_input": -1
    }
  ]
}
